In [1]:
import pandas as pd

In [3]:
temp_data = pd.DataFrame({
    'date': ['01-02-2026', '02-02-2026', '03-02-2026', '04-02-2026', '05-02-2026'],
    'temp': [23, 25, 17.7, 20.6, 24.5]
}, index=range(30, 35))

temp_data

          date  temp
30  01-02-2026  23.0
31  02-02-2026  25.0
32  03-02-2026  17.7
33  04-02-2026  20.6
34  05-02-2026  24.5

In [6]:
rainfall_data = pd.DataFrame({
    'date': ['01-02-2026', '02-02-2026', '03-02-2026', '04-02-2026', '05-02-2026',],
    'rainfall': [0, 2, 3.2, 1, 2]
}, index=range(50, 55))

rainfall_data

          date  rainfall
50  01-02-2026       0.0
51  02-02-2026       2.0
52  03-02-2026       3.2
53  04-02-2026       1.0
54  05-02-2026       2.0

In [9]:
pd.concat([temp_data, rainfall_data])  # By default vertical (axis=0)

          date  temp  rainfall
30  01-02-2026  23.0       NaN
31  02-02-2026  25.0       NaN
32  03-02-2026  17.7       NaN
33  04-02-2026  20.6       NaN
34  05-02-2026  24.5       NaN
50  01-02-2026   NaN       0.0
51  02-02-2026   NaN       2.0
52  03-02-2026   NaN       3.2
53  04-02-2026   NaN       1.0
54  05-02-2026   NaN       2.0

In [13]:
pd.concat([temp_data, rainfall_data], axis=1)  # Horizontal contact

          date  temp        date  rainfall
30  01-02-2026  23.0         NaN       NaN
31  02-02-2026  25.0         NaN       NaN
32  03-02-2026  17.7         NaN       NaN
33  04-02-2026  20.6         NaN       NaN
34  05-02-2026  24.5         NaN       NaN
50         NaN   NaN  01-02-2026       0.0
51         NaN   NaN  02-02-2026       2.0
52         NaN   NaN  03-02-2026       3.2
53         NaN   NaN  04-02-2026       1.0
54         NaN   NaN  05-02-2026       2.0

In [14]:
pd.concat([temp_data, rainfall_data], ignore_index=True)

         date  temp  rainfall
0  01-02-2026  23.0       NaN
1  02-02-2026  25.0       NaN
2  03-02-2026  17.7       NaN
3  04-02-2026  20.6       NaN
4  05-02-2026  24.5       NaN
5  01-02-2026   NaN       0.0
6  02-02-2026   NaN       2.0
7  03-02-2026   NaN       3.2
8  04-02-2026   NaN       1.0
9  05-02-2026   NaN       2.0

## Join

In [18]:
pd.concat([temp_data, rainfall_data], axis=0, join='inner')  # Displays rows of common column

          date
30  01-02-2026
31  02-02-2026
32  03-02-2026
33  04-02-2026
34  05-02-2026
50  01-02-2026
51  02-02-2026
52  03-02-2026
53  04-02-2026
54  05-02-2026

In [22]:
pd.concat([temp_data, rainfall_data], axis=0, join='outer')  # Displays rows of all the columns

          date  temp  rainfall
30  01-02-2026  23.0       NaN
31  02-02-2026  25.0       NaN
32  03-02-2026  17.7       NaN
33  04-02-2026  20.6       NaN
34  05-02-2026  24.5       NaN
50  01-02-2026   NaN       0.0
51  02-02-2026   NaN       2.0
52  03-02-2026   NaN       3.2
53  04-02-2026   NaN       1.0
54  05-02-2026   NaN       2.0

## Keys

In [52]:
keyed_df = pd.concat([temp_data, rainfall_data], axis=0, keys=('Delhi', 'Chennai'))
keyed_df

                  date  temp  rainfall
Delhi   30  01-02-2026  23.0       NaN
        31  02-02-2026  25.0       NaN
        32  03-02-2026  17.7       NaN
        33  04-02-2026  20.6       NaN
        34  05-02-2026  24.5       NaN
Chennai 50  01-02-2026   NaN       0.0
        51  02-02-2026   NaN       2.0
        52  03-02-2026   NaN       3.2
        53  04-02-2026   NaN       1.0
        54  05-02-2026   NaN       2.0

In [53]:
# multi index
keyed_df.index

MultiIndex([(  'Delhi', 30),
            (  'Delhi', 31),
            (  'Delhi', 32),
            (  'Delhi', 33),
            (  'Delhi', 34),
            ('Chennai', 50),
            ('Chennai', 51),
            ('Chennai', 52),
            ('Chennai', 53),
            ('Chennai', 54)],
           )

In [31]:
keyed_df.loc[('Delhi')]
keyed_df.loc[('Delhi', 31)]

          date  temp  rainfall
30  01-02-2026  23.0       NaN
31  02-02-2026  25.0       NaN
32  03-02-2026  17.7       NaN
33  04-02-2026  20.6       NaN
34  05-02-2026  24.5       NaN

date        02-02-2026
temp              25.0
rainfall           NaN
Name: (Delhi, 31), dtype: object

In [33]:
keyed_df.loc[[('Delhi', 30), ('Chennai', 50)]]

                  date  temp  rainfall
Delhi   30  01-02-2026  23.0       NaN
Chennai 50  01-02-2026   NaN       0.0

In [36]:
keyed_df = pd.concat([temp_data, rainfall_data], axis=1, keys=('Delhi', 'Chennai'))
keyed_df

         Delhi           Chennai
          date  temp        date rainfall
30  01-02-2026  23.0         NaN      NaN
31  02-02-2026  25.0         NaN      NaN
32  03-02-2026  17.7         NaN      NaN
33  04-02-2026  20.6         NaN      NaN
34  05-02-2026  24.5         NaN      NaN
50         NaN   NaN  01-02-2026      0.0
51         NaN   NaN  02-02-2026      2.0
52         NaN   NaN  03-02-2026      3.2
53         NaN   NaN  04-02-2026      1.0
54         NaN   NaN  05-02-2026      2.0

In [ ]:
keyed_df['Delhi'] # column label

          date  temp
30  01-02-2026  23.0
31  02-02-2026  25.0
32  03-02-2026  17.7
33  04-02-2026  20.6
34  05-02-2026  24.5
50         NaN   NaN
51         NaN   NaN
52         NaN   NaN
53         NaN   NaN
54         NaN   NaN

In [45]:
type(keyed_df)
type(keyed_df['Chennai'])
type(keyed_df.loc[32])

pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

pandas.core.series.Series

In [47]:
keyed_df.columns

MultiIndex([(  'Delhi',     'date'),
            (  'Delhi',     'temp'),
            ('Chennai',     'date'),
            ('Chennai', 'rainfall')],
           )

In [50]:
keyed_df[[('Delhi', 'date'), ('Chennai', 'date')]]

         Delhi     Chennai
          date        date
30  01-02-2026         NaN
31  02-02-2026         NaN
32  03-02-2026         NaN
33  04-02-2026         NaN
34  05-02-2026         NaN
50         NaN  01-02-2026
51         NaN  02-02-2026
52         NaN  03-02-2026
53         NaN  04-02-2026
54         NaN  05-02-2026